app/controllers/api/v1/pokemons_controller.rb

      def index
        @pokemons = Pokemon.all
        unless @pokemons.any?
          render status: :ok,
                 json: {
                   status: 'Database empty',
                   message: 'There are no Pokemon to show!'
                 }
        end

        if params[:page].present?
          pagination = (params[:limit] || 100)
          @pokemons = @pokemons.page(params[:page]).per(pagination)
---
SELECT "pokemons".* FROM "pokemons"
SELECT 1 AS one FROM "pokemons" LIMIT ?  [["LIMIT", 1]]
SELECT "pokemons".* FROM "pokemons" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 20]]

      def show
        @pokemon = Pokemon.find(params[:id])
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

      def create
        @pokemon = Pokemon.new(pokemon_params)
        if @pokemon.save
---
INSERT INTO "pokemons" ("name", "type_1", "type_2", "total", "hp", "attack", "defense", "sp_atk", "sp_def", "speed", "generation", "legendary", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

      def update
        @pokemon = Pokemon.find(params[:id])
        if @pokemon.update(pokemon_params)
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pokemons" SET "legendary" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["legendary", 1], ["updated_at", "2020-08-25 18:37:43.753201"], ["id", 1]]